app/controllers/titles_controller.rb

  def index
  	@titles = Title.all
---
SELECT "titles".* FROM "titles"

  def show
  	@title = Title.find(params[:id])
---
SELECT  "titles".* FROM "titles" WHERE "titles"."id" = ? LIMIT 1  [["id", 1]]

  def edit
  	#GET--should hsow a form to edit a school
  	@title = Title.find(params[:id])
---
SELECT  "titles".* FROM "titles" WHERE "titles"."id" = ? LIMIT 1  [["id", 3]]

	def update
  	@title = Title.find(params[:id])
---
SELECT  "titles".* FROM "titles" WHERE "titles"."id" = ? LIMIT 1  [["id", 6]]

  def create
		# POST---this will create a new book title in
		@title = Title.new(title_params)
		if @title.save
---
INSERT INTO "titles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-05-26 14:49:56.215641"], ["updated_at", "2016-05-26 14:49:56.215641"]]

  def destroy
  	#method is responsible for deleting single title out of the database
		Title.find(params[:id]).destroy
---
DELETE FROM "titles" WHERE "titles"."id" = ?  [["id", 6]]
SELECT  "titles".* FROM "titles" WHERE "titles"."id" = ? LIMIT 1  [["id", 6]]